{"contents":[{"title":"2019 Servtech - Senior Engineer","content":["I was responsible for Android tablet and smart watch APP. It can using QR code input data and google voice (RecognizerIntent) trigger button."]},{"title":"2018","content":["I was responsible for back-end project by Spring Boot framework, it's a RESTful Server for front-end call API. It's easier to use than Spring MVC.","I was responsible for SPC system project, it calculate the results of CUSUM and EWMA, both are the most common tool for monitoring a quality characteristic of interest."]},{"title":"2017","content":["I was responsible for factory work order scheduling system project, automated multi-line work order scheduling by work order information. ( reference OptaPlanner )","I was responsible for Android APP for mobile display platform information. And I resolve APP crashed problem when Android 5.0 update to Android 6.0.","I was responsible for middleware message platform project, it's used for exchange of information among different devices, e.g. Data transfer among platform, Android, iPhone. And I improve platform performance that the original mobile phone requesting two months of data originally needs to be executed for 90 seconds from platform. Finally, it takes only 5 seconds to complete. It's using pre-processing data and proxy LRU cache."]},{"title":"2015","content":["I resolve the problem of excessive amount of instant message data volume. Original, we use XML format for message, it needs a lot of flow to transfer data. I use Protocol Buffers to compressed and encrypted data. After a record original 1MB is reduced to 27KB.","I was responsible for Big data rule engine project, it's similar to Excel calculation rules for calculation and pivot analysis of big data. It use expression and Trie tree process data."]},{"title":"2014","content":["I was responsible for back-end project by Spring MVC framework, it's a RESTful Server for front-end call API. We switched to Spring MVC for security reasons. We use gradle build project, and it use MockMVC test. ( Unit test framework )","I improve I/O read file and Master-slave RPC performance that it use NIO selected channel and byte buffer in data processing, it prevent I/O blocking problem.","We participate Intel Global Challenge take first place, I was responsible for demo platform."]},{"title":"2014 Institute for Information Industry (iii) - Platform application development engineer","content":["The platform import NoSQL when the accumulated amount of data is too large. I was responsible for research related NoSQL technologies.  Finally, I deploy cluster of Hbase relies on Zookeeper.","I improve the stability of the platform that it use Memory Analyzer(MAT) analyze file of memory dump. I found some object reference static object, it can't release by garbage collection. I use weak reference resolved the problem of occasional memory leaks."]},{"title":"2013","content":["I was responsible for back-end project by Strust2 framework, and JAP with MySQL. It's a RESTful Server for front-end call API. And it use message queue (ActiveMQ) for other services.","I improve platform performance that it change real-time data processed from database to memory and reduce front-end API request by using pre-processing data. Finally, At the same time, original, it can handle data volume of 30 machines, after it can handle data volume of more than 100 machines. ( It fetch CNC controller or PLC point data from factory machine )"]}]}